{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "7c8b6ecc",
   "metadata": {},
   "source": [
    "Классический язык программирования в Битландии — Bit++. Этот язык очень необычный и сложный!\n",
    "\n",
    "Особенность языка Bit++ состоит в том, что в нем ровно одна переменная, которая называется x. Также в этом языке есть две операции:\n",
    "\n",
    "Операция ++ увеличивает значение, хранящееся в переменной x на 1.\n",
    "Операция -- уменьшает значение, хранящееся в переменной x на 1.\n",
    "Предложение в языке Bit++ — это последовательность, состоящая из ровно одной операции и ровно одной переменной x. Предложение записывается без пробелов, то есть может содержать только символы: «+», «-», «X». Выполнить предложение, значит выполнить операцию, которая содержится в предложении.\n",
    "\n",
    "Программа на языке Bit++ — это последовательность предложений, каждое из которых требуется выполнить. Выполнить программу, значит выполнить все ее предложения.\n",
    "\n",
    "Вам задана программа на языке Bit++. Перед выполнением программы в переменной x хранится значение 0. Выполните программу и выведите значение, которое будет храниться в переменной x после выполнения программы.\n",
    "\n",
    " ## Входные данные\n",
    "В первой строке записано единственное целое число n (1 ≤ n ≤ 150) — количество предложений в программе. В каждой из следующих n строк записано по предложению. Каждое предложение состоит из ровно одной операции (++ или --) и ровно одной переменной x (обозначается буквой «X»). Таким образом, не бывает пустых предложений. Операция и переменная могут быть записаны в любом порядке.\n",
    "\n",
    "## Выходные данные\n",
    "Выведите единственное целое число — значение, которое будет храниться в переменной x после выполнения программы.\n",
    "\n",
    "### входные данные\n",
    "1\n",
    "++X\n",
    "\n",
    "### выходные данные\n",
    "1"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "87f360ee",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 X-- X++\n"
     ]
    }
   ],
   "source": [
    "# m = list(map(str, input().split()))\n",
    "# n = int(m[0])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "id": "a454e388",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2\n",
      "X++\n",
      "x--\n",
      "0\n"
     ]
    }
   ],
   "source": [
    "n = int(input())\n",
    "result = 0\n",
    "for i in range(0,n):\n",
    "    s = input()\n",
    "    if '++' in s:\n",
    "        result += 1\n",
    "    else:\n",
    "        result -= 1\n",
    "print(result)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "f10f7795",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.8"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
