{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "8daa7ef6",
   "metadata": {},
   "source": [
    "Однажды трое лучших друзей Петя, Вася и Тоня решили создать команду и участвовать в соревновании по программированию. Обычно на соревнованиях по программированию участникам предлагается несколько задач. Еще перед началом друзья договорились, что они будут реализовывать задачу, если как минимум двое из них придумали и уверены в решении, в противном случае ребята не будут писать решение этой задачи.\n",
    "\n",
    "На этом соревновании организаторы предложили n задач. Для каждой задачи известно, кто из друзей придумал и уверен в ее решении. Помогите друзьям найти количество задач, по которым они будут писать решение.\n",
    "\n",
    "### Входные данные\n",
    "В первой строке входных данных записано единственное целое число n (1 ≤ n ≤ 1000) — количество задач на соревновании. Далее в n строках записано по три целых числа, каждое из которых равно 0 или 1. Если первое число в строке равно 1, то Петя уверен в решении этой задачи, в противном случае он не уверен в решении. Второе число обозначает мнение Васи, а третье — мнение Тони. Числа в строках разделены пробелами.\n",
    "\n",
    "### Выходные данные\n",
    "Выведите единственное целое число — количество задач, которые друзья будут реализовывать на соревновании.\n",
    "\n",
    "### входные данные\n",
    "3\n",
    "1 1 0\n",
    "1 1 1\n",
    "1 0 0\n",
    "### выходные данные\n",
    "2"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 211,
   "id": "6e97b236",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Кол-во задач: 2 \n",
      "Мнения ребят о задаче 1\n",
      "1 1 1\n",
      "Мнения ребят о задаче 2\n",
      "0 0 0 \n",
      "1\n"
     ]
    }
   ],
   "source": [
    "res = 0\n",
    "n = int(input('Кол-во задач: '))\n",
    "lst = []\n",
    "for i in range(n):\n",
    "    print(\"Мнения ребят о задаче\", i+1)\n",
    "    lst.append((input().split()))\n",
    "lst = [sum([int(float(j)) for j in i]) for i in lst]\n",
    "for i in range(len(lst)): \n",
    "    if lst[i] >=2:\n",
    "        res =+ 1\n",
    "print(res)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "154c4b95",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.8"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
