{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "9c7c5e80",
   "metadata": {},
   "source": [
    " Перед Вами матрица размера 5 × 5, состоящая из 24-x нулей и единственной единицы. Строки матрицы пронумеруем числами от 1 до 5 сверху вниз, столбцы матрицы пронумеруем числами от 1 до 5 слева направо. За один ход разрешается применить к матрице одно из двух следующих преобразований:\n",
    "\n",
    "Поменять местами две соседние строки матрицы, то есть строки с номерами i и i + 1 для некоторого целого i (1 ≤ i < 5).\n",
    "Поменять местами два соседних столбца матрицы, то есть столбцы с номерами j и j + 1 для некоторого целого j (1 ≤ j < 5).\n",
    "Вы считаете, что матрица будет выглядеть красиво, если единственная единица этой матрицы будет находиться в ее центре (в клетке, которая находится на пересечении третьей строки и третьего столбца). Посчитайте, какое минимальное количество ходов потребуется, чтобы сделать матрицу красивой.\n",
    "\n",
    "### Входные данные\n",
    "Входные данные состоят из пяти строк, в каждой из которых записаны пять целых чисел: j-ое число в i-ой строке входных данных обозначает элемент матрицы, стоящий на пересечении i-ой строки и j-ого столбца. Гарантируется, что матрица состоит из 24-x нулей и единственной единицы.\n",
    "\n",
    "### Выходные данные\n",
    "Выведите единственное целое число — минимальное количество действий, которое требуется, чтобы сделать матрицу красивой."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "e3be187a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0 0 0 0 0 0 0 0 0 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0\n",
      "3\n"
     ]
    }
   ],
   "source": [
    "lst1 = list(map(int, input().split()))\n",
    "matrix = []\n",
    "while lst1 != []:\n",
    "    matrix.append(lst1[:5])\n",
    "    lst1 = lst1[5:]\n",
    "    \n",
    "row = 0 \n",
    "actions = 0\n",
    "\n",
    "for i in matrix:\n",
    "    column = 0\n",
    "    for j in i:\n",
    "        if matrix[row][column] == 1:\n",
    "            if row < 2:\n",
    "                actions += 2 - row\n",
    "            if row > 2:\n",
    "                actions += row - 2\n",
    "            if column < 2:\n",
    "                actions += 2 - column\n",
    "            if column > 2:\n",
    "                actions += column - 2\n",
    "        column += 1\n",
    "    row += 1\n",
    "print(actions)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "dee52a6b",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.8"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
